In [1]:
import pandas as pd

In [60]:
# IMPORT RAW DATA FOR S&P500, AAL, DAL, BAC, WFC
# RENAME ADJ CLOSE COLUMN TO TICKER SYMBOL
# CONSOLIDATE DATAFRAME INTO TWO COLUMNS, 'DATE' & 'TICKER SYMBOL'
# CHECK TO MAKE SURE DATAFRAME LENGTH IS 120 AND NO NULL VALUES
# SAVE DATAFRAME TO A NEW CSV FILE NAMED <TICKER>_clean.csv

In [2]:
# S&P500
sp500_df = pd.read_csv("^GSPC.csv")

In [3]:
sp500_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2010-01-01,1116.560059,1150.449951,1071.589966,1073.869995,1073.869995,90947580000
1,2010-02-01,1073.890015,1112.420044,1044.500000,1104.489990,1104.489990,84561340000
2,2010-03-01,1105.359985,1180.689941,1105.359985,1169.430054,1169.430054,103683550000
3,2010-04-01,1171.229980,1219.800049,1170.689941,1186.689941,1186.689941,116741910000
4,2010-05-01,1188.579956,1205.130005,1040.780029,1089.410034,1089.410034,127662780000

In [4]:
sp500_df = sp500_df.rename(columns = {'Adj Close': 'S&P500'})
sp500_df.head()

,Date,Open,High,Low,Close,S&P500,Volume
0,2010-01-01,1116.560059,1150.449951,1071.589966,1073.869995,1073.869995,90947580000
1,2010-02-01,1073.890015,1112.420044,1044.500000,1104.489990,1104.489990,84561340000
2,2010-03-01,1105.359985,1180.689941,1105.359985,1169.430054,1169.430054,103683550000
3,2010-04-01,1171.229980,1219.800049,1170.689941,1186.689941,1186.689941,116741910000
4,2010-05-01,1188.579956,1205.130005,1040.780029,1089.410034,1089.410034,127662780000

In [5]:
sp500_clean = sp500_df[['Date','S&P500']]
sp500_clean.head()

         Date       S&P500
0  2010-01-01  1073.869995
1  2010-02-01  1104.489990
2  2010-03-01  1169.430054
3  2010-04-01  1186.689941
4  2010-05-01  1089.410034

In [6]:
len(sp500_clean)

120

In [7]:
len(sp500_clean.dropna())

120

In [19]:
sp500_clean.to_csv(r'C:\Users\Clay\Desktop\Group9_Project1\Data_Analysis\S&P500_clean.csv')

In [ ]:
#######################################################################################

In [11]:
# AAL
aal_df = pd.read_csv("AAL.csv")

In [12]:
aal_df.head()

         Date  Open  High   Low  Close  Adj Close     Volume
0  2010-01-01  4.84  5.96  4.47   5.31   5.005957  262480900
1  2010-02-01  5.43  7.40  5.35   7.33   6.910295  230715100
2  2010-03-01  7.41  8.17  6.81   7.35   6.929150  173820100
3  2010-04-01  7.37  7.87  6.27   7.07   6.665183  326723600
4  2010-05-01  7.21  8.97  5.70   8.83   8.324407  262008300

In [13]:
aal_df = aal_df.rename(columns = {'Adj Close': 'AAL'})
aal_df.head()

         Date  Open  High   Low  Close       AAL     Volume
0  2010-01-01  4.84  5.96  4.47   5.31  5.005957  262480900
1  2010-02-01  5.43  7.40  5.35   7.33  6.910295  230715100
2  2010-03-01  7.41  8.17  6.81   7.35  6.929150  173820100
3  2010-04-01  7.37  7.87  6.27   7.07  6.665183  326723600
4  2010-05-01  7.21  8.97  5.70   8.83  8.324407  262008300

In [15]:
aal_clean = aal_df[['Date','AAL']]
aal_clean.head()

         Date       AAL
0  2010-01-01  5.005957
1  2010-02-01  6.910295
2  2010-03-01  6.929150
3  2010-04-01  6.665183
4  2010-05-01  8.324407

In [16]:
len(aal_clean)

120

In [17]:
len(aal_clean.dropna())

120

In [22]:
aal_clean.to_csv(r'C:\Users\Clay\Desktop\Group9_Project1\Data_Analysis\AAL_clean.csv')

In [ ]:
#######################################################################################

In [23]:
# DAL
dal_df = pd.read_csv('DAL.csv')

In [24]:
dal_df.head()

         Date   Open   High    Low  Close  Adj Close     Volume
0  2010-01-01  11.22  13.73  10.95  12.23  10.863926  334450000
1  2010-02-01  12.37  13.21  10.93  12.92  11.476853  215161100
2  2010-03-01  12.93  14.90  12.33  14.59  12.960317  236270900
3  2010-04-01  14.63  14.94  11.95  12.08  10.730680  320889200
4  2010-05-01  12.30  14.48  10.90  13.58  12.063131  291751900

In [25]:
dal_df = dal_df.rename(columns = {'Adj Close': 'DAL'})
dal_df.head()

         Date   Open   High    Low  Close        DAL     Volume
0  2010-01-01  11.22  13.73  10.95  12.23  10.863926  334450000
1  2010-02-01  12.37  13.21  10.93  12.92  11.476853  215161100
2  2010-03-01  12.93  14.90  12.33  14.59  12.960317  236270900
3  2010-04-01  14.63  14.94  11.95  12.08  10.730680  320889200
4  2010-05-01  12.30  14.48  10.90  13.58  12.063131  291751900

In [26]:
dal_clean = dal_df[['Date','DAL']]
dal_clean.head()

         Date        DAL
0  2010-01-01  10.863926
1  2010-02-01  11.476853
2  2010-03-01  12.960317
3  2010-04-01  10.730680
4  2010-05-01  12.063131

In [27]:
len(dal_clean)

120

In [28]:
len(dal_clean.dropna())

120

In [29]:
dal_clean.to_csv(r'C:\Users\Clay\Desktop\Group9_Project1\Data_Analysis\DAL_clean.csv')

In [ ]:
#######################################################################################

In [47]:
# BAC
bac_df = pd.read_csv('BAC.csv')

In [48]:
bac_df.head()

         Date       Open       High        Low  Close  Adj Close      Volume
0  2010-01-01  15.240000  17.190001  14.680000  15.18  13.460909  4592014200
1  2010-02-01  15.260000  16.840000  14.250000  16.66  14.773309  4083459900
2  2010-03-01  16.740000  18.350000  16.030001  17.85  15.828542  3801296800
3  2010-04-01  18.020000  19.860001  17.410000  17.83  15.820416  4365611500
4  2010-05-01  17.879999  18.150000  14.800000  15.74  13.965980  4577665100

In [49]:
bac_df = bac_df.rename(columns = {'Adj Close': 'BAC'})
bac_df.head()

         Date       Open       High        Low  Close        BAC      Volume
0  2010-01-01  15.240000  17.190001  14.680000  15.18  13.460909  4592014200
1  2010-02-01  15.260000  16.840000  14.250000  16.66  14.773309  4083459900
2  2010-03-01  16.740000  18.350000  16.030001  17.85  15.828542  3801296800
3  2010-04-01  18.020000  19.860001  17.410000  17.83  15.820416  4365611500
4  2010-05-01  17.879999  18.150000  14.800000  15.74  13.965980  4577665100

In [50]:
bac_clean = bac_df[['Date','BAC']]
bac_clean.head()

         Date        BAC
0  2010-01-01  13.460909
1  2010-02-01  14.773309
2  2010-03-01  15.828542
3  2010-04-01  15.820416
4  2010-05-01  13.965980

In [51]:
len(bac_clean)

120

In [52]:
len(bac_clean.dropna())

120

In [37]:
bac_clean.to_csv(r'C:\Users\Clay\Desktop\Group9_Project1\Data_Analysis\BAC_clean.csv')

In [ ]:
#######################################################################################

In [53]:
# WFC
wfc_df = pd.read_csv('WFC.csv')

In [54]:
wfc_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2010-01-01,27.020000,29.430000,26.820000,28.430000,21.231312,1009905300
1,2010-02-01,28.600000,29.129999,26.370001,27.340000,20.417307,840453900
2,2010-03-01,27.450001,31.990000,27.150000,31.120001,23.280611,817434600
3,2010-04-01,31.400000,34.250000,31.129999,33.110001,24.769310,943549600
4,2010-05-01,33.220001,34.090000,27.440001,28.690001,21.462746,1142687200

In [55]:
wfc_df = wfc_df.rename(columns = {'Adj Close': 'WFC'})
wfc_df.head()

,Date,Open,High,Low,Close,WFC,Volume
0,2010-01-01,27.020000,29.430000,26.820000,28.430000,21.231312,1009905300
1,2010-02-01,28.600000,29.129999,26.370001,27.340000,20.417307,840453900
2,2010-03-01,27.450001,31.990000,27.150000,31.120001,23.280611,817434600
3,2010-04-01,31.400000,34.250000,31.129999,33.110001,24.769310,943549600
4,2010-05-01,33.220001,34.090000,27.440001,28.690001,21.462746,1142687200

In [56]:
wfc_clean = wfc_df[['Date','WFC']]
wfc_clean.head()

         Date        WFC
0  2010-01-01  21.231312
1  2010-02-01  20.417307
2  2010-03-01  23.280611
3  2010-04-01  24.769310
4  2010-05-01  21.462746

In [57]:
len(wfc_clean)

120

In [58]:
len(wfc_clean.dropna())

120

In [59]:
wfc_clean.to_csv(r'C:\Users\Clay\Desktop\Group9_Project1\Data_Analysis\WFC_clean.csv')